class dataSchema {



    bankSchema(status) {
        let mellatBankReturnCode =
            {
                0 :'ﺗﺮاﻛﻨﺶ ﺑﺎ ﻣﻮﻓﻘﻴﺖ اﻧﺠﺎم ﺷﺪ',
                11: 'ﺷﻤﺎره ﻛﺎرت ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                12: 'ﻣﻮﺟﻮدي ﻛﺎﻓﻲ ﻧﻴﺴﺖ',
                13: 'رﻣﺰ ﻧﺎدرﺳﺖ اﺳﺖ',
                14: 'ﺗﻌﺪاد دﻓﻌﺎت وارد ﻛﺮدن رﻣﺰ ﺑﻴﺶ از ﺣﺪ ﻣﺠﺎز اﺳﺖ',
                15:'ﻛﺎرت ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                16: 'دﻓﻌﺎت ﺑﺮداﺷﺖ وﺟﻪ ﺑﻴﺶ از ﺣﺪ ﻣﺠﺎز اﺳﺖ',
                17:'ﻛﺎرﺑﺮ از اﻧﺠﺎم ﺗﺮاﻛﻨﺶ ﻣﻨﺼﺮف ﺷﺪه اﺳﺖ',
                18:'ﺗﺎرﻳﺦ اﻧﻘﻀﺎي ﻛﺎرت ﮔﺬﺷﺘﻪ اﺳﺖ',
                19:'ﻣﺒﻠﻎ ﺑﺮداﺷﺖ وﺟﻪ ﺑﻴﺶ از ﺣﺪ ﻣﺠﺎز اﺳﺖ',
                111: 'ﺻﺎدر ﻛﻨﻨﺪه ﻛﺎرت ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                112:'ﺧﻄﺎي ﺳﻮﻳﻴﭻ ﺻﺎدر ﻛﻨﻨﺪه ﻛﺎرت',
                113:'ﭘﺎﺳﺨﻲ از ﺻﺎدر ﻛﻨﻨﺪه ﻛﺎرت درﻳﺎﻓﺖ ﻧﺸﺪ',
                114:'دارﻧﺪه ﻛﺎرت ﻣﺠﺎز ﺑﻪ اﻧﺠﺎم اﻳﻦ ﺗﺮاﻛﻨﺶ ﻧﻴﺴﺖ',
                21:'ﭘﺬﻳﺮﻧﺪه ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                23:'ﺧﻄﺎي اﻣﻨﻴﺘﻲ رخ داده اﺳﺖ',
                24:'اﻃﻼﻋﺎت ﻛﺎرﺑﺮي ﭘﺬﻳﺮﻧﺪه ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                25:'ﻣﺒﻠﻎ ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                31:'ﭘﺎﺳﺦ ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                32:'ﻓﺮﻣﺖ اﻃﻼﻋﺎت وارد ﺷﺪه ﺻﺤﻴﺢ ﻧﻤﻲ ﺑﺎﺷﺪ',
                33:'ﺣﺴﺎب ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                34:'ﺧﻄﺎي ﺳﻴﺴﺘﻤﻲ',
                35:'ﺗﺎرﻳﺦ ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                41:'ﺷﻤﺎره درﺧﻮاﺳﺖ ﺗﻜﺮاري اﺳﺖ',
                42: 'ﺗﺮاﻛﻨﺶ یافت نشد ',
                43: 'ﺒﻼ درﺧﻮاﺳﺖ داده ﺷﺪه اﺳﺖ',
                44: 'درخواست یافت نشد',
                45: 'ﺗﺮاﻛﻨﺶ ﺷﺪه اﺳﺖ',
                46: 'ﺗﺮاﻛﻨﺶ نشده اﺳﺖ',
                47: 'ﺗﺮاﻛﻨﺶ یافت نشد',
                48: 'تراکنش شده است',
                49: 'تراکنش یافت نشد',
                412: 'شناسه قبض نادرست است',
                413: 'ﺷﻨﺎﺳﻪ ﭘﺮداﺧﺖ ﻧﺎدرﺳﺖ اﺳﺖ',
                414: 'سازﻣﺎن ﺻﺎدر ﻛﻨﻨﺪه ﻗﺒﺾ ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                415: 'زﻣﺎن ﺟﻠﺴﻪ ﻛﺎري ﺑﻪ ﭘﺎﻳﺎن رسیده است',
                416: 'ﺧﻄﺎ در ﺛﺒﺖ اﻃﻼﻋﺎت',
                417: 'ﺷﻨﺎﺳﻪ ﭘﺮداﺧﺖ ﻛﻨﻨﺪه ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                418: 'اﺷﻜﺎل در ﺗﻌﺮﻳﻒ اﻃﻼﻋﺎت ﻣﺸﺘﺮي',
                419: 'ﺗﻌﺪاد دﻓﻌﺎت ورود اﻃﻼﻋﺎت از ﺣﺪ ﻣﺠﺎز ﮔﺬﺷﺘﻪ اﺳﺖ',
                421: 'IP نامعتبر است' ,
                51: 'ﺗﺮاﻛﻨﺶ ﺗﻜﺮاري اﺳﺖ',
                54: 'ﺗﺮاﻛﻨﺶ ﻣﺮﺟﻊ ﻣﻮﺟﻮد ﻧﻴﺴﺖ',
                55: 'ﺗﺮاﻛﻨﺶ ﻧﺎﻣﻌﺘﺒﺮ اﺳﺖ',
                61: 'ﺧﻄﺎ در واریز'
            };
        if(mellatBankReturnCode[status]) {
            return mellatBankReturnCode[status+''];
        } else {
            return '';
        }
    }
}


module.exports = dataSchema;
